'Напишите программу которая спросит два числа и выведет среднее арифмитическое'
print('Введите два числа')
num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))
print('Среднее арифмитическое: ',(num1+num2)/2)