#Напишите программу, которая спросит число, вычтет 2 и умножит на 3
num = int(input('Введите число: '))
print('Результат: ',(num-2)*3)