#Создайте чат бота который спросит ваше имя, после ответ спросит ваше отчество и поздоровается с вами
name1 = input('Как вас зовут? ')
name2 = input('Скажите как вас по отчеству? ')
print('Добрый день',name1,name2+'!')
