'Создайте чат бота,который будет общаться с человеком так:'
'Здравствуйте. Кто вы?'
'Приятно познакомиться(Имя)'
'А что вы тут делаете'
'Понимаю (предыдущий ответ) это важно'
'Какой ваш любимый цвет?'
'Какое ваше любимое животное?'
'Я придумал выше тотемное жиотное(Цвет + Животное)'
name = input('Добрый день как вас зовут: ')
print('Добрый день', name)
input('Что вы тут делаете?: ')
color = input('Какой ваш любимый цвет?: ')
animal = input('Какое ваше любимое животное?:')
print('Я придумал ваше тотемное животное! Это:',color,animal+'!')