'Напишите программу которая спросит год , а потом скажет какой следующий год и предыдущий год и в конце Точка без пробела'
year = int(input('Введи какой сейчас год: '))
print('Значит, предыдущий год был',str(year-1)+',а следующий год ', str(year+1) + '.')